UserNamezhangxi/stm32_blance_car/car_control_code/Hardware/Encoder/Encoder.c
#include "stm32f10x.h" // Device header
#include "key.h"
#include "usart.h"
#include "encoder.h"

void Encoder_Init(void)
{
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);

	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);

	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
	TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInitStructure.TIM_Period = 65536 - 1; // ARR
	TIM_TimeBaseInitStructure.TIM_Prescaler = 1 - 1;  // PSC
	TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0;
	TIM_TimeBaseInit(TIM4, &TIM_TimeBaseInitStructure);

	TIM_ICInitTypeDef TIM_ICInitStructure;
	TIM_ICStructInit(&TIM_ICInitStructure);
	TIM_ICInitStructure.TIM_Channel = TIM_Channel_1;
	TIM_ICInitStructure.TIM_ICFilter = 0xF;
	TIM_ICInit(TIM4, &TIM_ICInitStructure);
	TIM_ICInitStructure.TIM_Channel = TIM_Channel_2;
	TIM_ICInitStructure.TIM_ICFilter = 0xF;
	TIM_ICInit(TIM4, &TIM_ICInitStructure);

	TIM_EncoderInterfaceConfig(TIM4, TIM_EncoderMode_TI12, TIM_ICPolarity_Rising, TIM_ICPolarity_Rising);

	TIM_Cmd(TIM4, ENABLE);
}

int16_t Encoder_Get(void)
{
	return TIM_GetCounter(TIM4);
}

int16_t get_music_volume(u8 tp)
{
	// 编码器音量
	u8 vol = 0;
	
  int16_t volume = Encoder_Get() / 4 + 20; // 编码器四线 所以除以4 得到每转一次的记次 默认音量为20
	if (volume <= 0)
	{
		vol = 0;
	}
	else if (volume >= 30)
	{
		vol = 30;
	} 
	else 
	{	
		vol = volume;
	}
	printf("tp = %d, vol = %d \r\n", tp, vol);
	if (tp != vol)
	{
		tp = vol;
		return vol;
	}
	else
	{
		return NO_KEY;
	}
}
